[33m0738175[m[33m ([m[1;36mHEAD -> [m[1;32mdev[m[33m)[m Merge branch 'dev' of https://github.com/CrazyStudent13/resume into dev
[33m201700d[m feat: 修改描述
[33m6877ccb[m feat: 添加loading效果
[33mf7f2ca8[m feat: 将所有界面数据整合到pina中，统一管理
[33ma50909b[m feat: 初步添加pina，但是有点看不懂用法
[33m962dde4[m fix: 修复edge和chorme浏览器的适配效果
[33mffcb4aa[m feat: 删除无效文件
[33m8f53ff5[m feat: 修改内容部分字体大小
[33m1830a42[m feat: 拆分简历模块，完成不同模块的组件
[33m4c6edd3[m feat: 修改公共样式
[33ma9f19fc[m feat: 修改配置简介
[33maa568a4[m feat: 删除多余文件
[33m7915d47[m fix: 修复代码格式化失效问题
[33mcd084a1[m[33m ([m[1;31morigin/dev[m[33m)[m feat: 修改描述
[33m9cc8e19[m feat: 添加loading效果
[33m8665c00[m feat: 将所有界面数据整合到pina中，统一管理
[33m25e63ad[m feat: 初步添加pina，但是有点看不懂用法
[33m71193c2[m Merge branch 'dev' of https://github.com/CrazyStudent13/resume into dev
[33mf914ffa[m fix: 修复edge和chorme浏览器的适配效果
[33m6b20c02[m feat: 删除无效文件
[33m6dd13d3[m feat: 修改内容部分字体大小
[33mf320b17[m feat: 拆分简历模块，完成不同模块的组件
[33m5efb1d5[m feat: 修改公共样式
[33mc233083[m feat: 修改配置简介
[33m716da5b[m feat: 删除多余文件
[33m6dc42b7[m fix: 修复代码格式化失效问题
[33ma3f6dff[m feat: 配置格式化偏好
[33m3e4ec35[m feat: 添加代码格式化偏好
[33m3d4495c[m feat: 初步调整一下宽度
[33m55aee49[m feat: 初步完成个人信息的展示
[33m6d7a107[m feat: 初步完成项目的初始化效果
[33md56dbdd[m[33m ([m[1;31morigin/main[m[33m, [m[1;31morigin/HEAD[m[33m, [m[1;32mmain[m[33m)[m feat:添加说明并初始化目录结构
[33m43abc1f[m Initial commit
