// 技能信息
export const skillInfo = {
  skill: [
    {
      title: '前端技能',
      data: [
        '扎实的H5，CSS3，JS基础，熟悉页面架构和布局，能够完美页面还原',
        '丰富的elementUI（2和3），同时熟悉DataV+Echart等数据大屏插件的使用',
        '熟练掌握ES6, TS + Vue2/3 框架的使用以及相关的生态，并对vue2/3的源码底层有过一定研究',
        '熟悉前端开发中的各个工具链使用，熟悉Vite和 Webpack的配置，使用过 Rollup 打包过工具库',
        '有良好的代码风格和编程习惯，有较强的 ESlint  规范，曾为公司团队制作过标准',
        '熟练使用前端流程管理工具 Git，Svn，曾建立过githooks检测',
        '熟悉使用 uni-app，有丰富的微信小程序兼容经验和H5端的通用开发',
        '能够部署npm私服，搭建项目模板和公司内部公用的项目组件库',
      ],
    },
  ],
}
